package tutor

object N01_Why_scala:
    def test() =
        println("""
        스칼라를 사용하는데 많은 장점들이 있지만 모든 장점을 서술하는 것은 어렵습니다. 그래서 Top 10을 뽑았습니다.
        
        1. 스칼라는 함수형 프로그래밍(FP)과 객체지향 프로그래밍(OOP)을 포함한 언어입니다.
        
        2. 스칼라는 정적타입입니다. 하지만 때때로 동적타입 언어처럼 느껴집니다.
        
        3. 스칼라의 문법은 간결하지만, 여전히 가독성(표현력)이 좋습니다.
        
        4. 스칼라2의 암시적이었던 정의기능은 스칼라3에서 개선되고 단순화 되었습니다.
        
        5. 스칼라는 자바와 원활하게 통합되므로 스칼라와 자바가 혼합된 프로젝트를 생성할 수 있으며 수천개의 기존 자바 라이브러리를 쉽게 사용할 수 있습니다.
        
        6. 스칼라는 Scala.js를 이용해 서버나 브라우저에서 사용될 수 있습니다
        
        7. 스칼라 표준 라이브러리를 사용하면 for loop나 알고리즘을 손쉽게 커스터마이징하여 시간을 절약할 수 있습니다.
        
        8. 불변성, 익명함수, 고차함수, 패턴매치, default부터 확장되지 않는 클래스 등 다양한 모범사례가 스칼라에 내장되어 있습니다.
        
        9. 스칼라 생태계는 세계에서 가장 현대적인 FP 라이브러리를 제공합니다.
        
        10. Strong 형식 시스템
        """)